.skills/openclaw-skills/skills/basuev/ews-skill/templates/get-item.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
  <soap:Header>
    <t:RequestServerVersion Version="Exchange2016"/>
  </soap:Header>
  <soap:Body>
    <GetItem xmlns="http://schemas.microsoft.com/exchange/services/2006/messages"
             xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
      <ItemShape>
        <t:BaseShape>Default</t:BaseShape>
        <t:AdditionalProperties>
          <t:FieldURI FieldURI="item:Body"/>
        </t:AdditionalProperties>
        <t:BodyType>Text</t:BodyType>
      </ItemShape>
      <ItemIds>
        <t:ItemId Id="__ITEM_ID__"/>
      </ItemIds>
    </GetItem>
  </soap:Body>
</soap:Envelope>
